{
    "QueuedTracking": {
        "AvailableRedisBackendTypeCluster": "Cluster",
        "AvailableRedisBackendTypeSentinel": "Sentinel",
        "AvailableRedisBackendTypeStandAlone": "Stand-alone",
        "BackendSettingFieldHelp": "Επιλέξτε το πίσω μέρος που θέλετε να χρησιμοποιείτε για αυτό το χαρακτηριστικό. Αν δεν έχετε εμπειρία με το Redis ή αν δεν είναι διαθέσιμο στο διακομιστή σας, προτείνουμε τη χρήση της Mysql.",
        "BackendSettingFieldTitle": "Πίσω μέρος (backend)",
        "ExceptionValueIsNotInt": "Η τιμή δεν είναι ακέραιος",
        "MasterNameFieldHelp": "Αν το Sentinel είναι ενεργό χρειάζεται να παραμετροποιηθεί μόνο το όνομα του κυρίου Sentinel.",
        "MasterNameFieldTitle": "Όνομα Κύριου Redis Sentinel",
        "MultipleServersOnlyConfigurableIfSentinelEnabled": "Πολλαπλοί διακομιστές ή θύρες μπορούν να παραμετροποιηθούν όταν το Redis Sentinel είναι ενεργοποιημένο. Δείτε στο αρχείο README του πρόσθετου για να μάθετε πώς να το κάνετε.",
        "NumHostsNotMatchNumPorts": "Ο αριθμός διακομιστών για τους οποίους έγινε ρύθμιση δεν συμφωνεί με τον αριθμό των θυρών που παραμετροποιήθηκαν.",
        "NumRequestsToProcessFieldHelp": "Καθορίζει πόσες αιτήσεις θα επιλέγονται από την ουρά και θα επεξεργάζονται σε κάθε παρτίδα. Εισάγετε ένα αριθμό &gt;=1.",
        "NumRequestsToProcessFieldTitle": "Αριθμός αιτήσεων που θα επεξεργάζονται σε μια παρτίδα",
        "NumberOfQueueWorkersFieldHelp": "Μέγιστος αριθμός επιτρεπόμενων εργατών ουράς. Δέχεται αριθμό μεταξύ 1 και 16. Καλύτερη πρακτική θεωρείται να βάλετε τον αριθμό των επεξεργαστών που θέλετε να έχετε διαθέσιμους για επεξεργασία ουράς. Βεβαιωθείτε ότι πρέπει να ξεκινάτε τους εργάτες χειροκίνητα. Προτείνουμε να μην χρησιμοποιείτε εργάτες μεταξύ 9 και 15, αντίθετα χρησιμοποιήστε 8 ή 16 καθώς η ουρά ενδέχεται να μην μοιράζεται ισόποσα σε διαφορετικές ουρές.",
        "NumberOfQueueWorkersFieldHelpNew": "Ο αριθμός των μέγιστων επιτρεπόμενων εργατών ουράς. Δέχεται ένα αριθμό μεταξύ 1 και 4096. Η βέλτιστη πρακτική είναι ο ορισμός του αριθμού των επεξεργαστών που θέλετε να κάνετε διαθέσιμους για την επεξεργασία ουράς. Έχετε το νου σας ότι οι εργάτες θα πρέπει να ξεκινούν χειροκίνητα. Δεν προτείνουμε τη χρήση εργατών μεταξύ 9-15, αλλά καλύτερα να χρησιμοποιήσετε μεταξύ 8 και 16, καθώς η ουρά δύναται να μην μοιράζεται ισόποσα σε διαφορετικές ουρές.",
        "NumberOfQueueWorkersFieldTitle": "Αριθμός εργατών ουράς",
        "ProcessDuringRequestFieldHelp": "Αν είναι ενεργό, θα γίνεται επεξεργασία των αιτήσεων μέσα σε μια ουρά στη διάρκεια μιας κανονικής αίτησης ιχνηλάτησης από τη στιγμή που θα υπάρχουν αιτήσεις στην ουρά. Αυτό δε θα καθυστερήσει την αίτηση ιχνηλάτησης. Αν είναι ανενεργό, πρέπει να ορίσετε μια εργασία cronjob που θα εκτελεί την εντολή κονσόλας %1$s./console queuedtracking:process%2$s κάθε λεπτό για να γίνεται επεξεργασία της ουράς.",
        "ProcessDuringRequestFieldTitle": "Επεξεργασία στην περίοδο αίτησης ιχνηλάτησης",
        "QueueEnabledFieldHelp": "Αν είναι ενεργό, όλες οι αιτήσεις ιχνηλάτησης θα γράφονται σε ουρά αντί για κατευθείαν στη βάση δεδομένων. Αυτό απαιτεί ένα διακομιστή Redis με την επέκταση phpredis αν θα χρησιμοποιείται το Redis ως πίσω μέρος.",
        "QueueEnabledFieldTitle": "Η ουρά ενεργοποιήθηκε",
        "RedisDatabaseFieldHelp": "Στην περίπτωση που χρησιμοποιείτε Redis για προσωρινή μνήμη βεβαιωθείτε να χρησιμοποιήστε διαφορετική βάση δεδομένων.",
        "RedisDatabaseFieldTitle": "Βάση δεδομένων Redis",
        "RedisHostFieldHelp": "Απομακρυσμένος διακομιστής ή unix socket του διακομιστή Redis. Επιτρέπονται μέγιστο 500 χαρακτήρες.",
        "RedisHostFieldHelpExtended": "Αν ο διακομιστής σας απαιτεί σύνδεση TLS, μπορείτε να βάλετε από μπροστά το TLS πρωτόκολλο στο διακομιστή σας όπως στο tls://example-host.com. Αν αυτό δε δουλέψει, βεβαιωθείτε ότι τα πιστοποιητικά έχουν εγκατασταθεί σωστά στον διακομιστή σας του Matomo.",
        "RedisHostFieldHelpExtendedSentinel": "Αν χρησιμοποιείτε το Redis Sentinel, μπορείτε να χρησιμοποιήσετε μια λίστα χωρισμένη με κόμμα. Βεβαιωθείτε να ορίσετε τόσους διακομιστές όσους έχετε και στις αντίστοιχες θύρες. Για παράδειγμα, για να παραμετροποιήσετε δύο διακομιστές “127.0.0.1:26379” και “127.0.0.2:26879” καθορίστε το “127.0.0.1,127.0.0.2” ως διακομιστή και το “26379,26879” ως θύρες.",
        "RedisHostFieldTitle": "Διακομιστής Redis ή unix socket",
        "RedisPasswordFieldHelp": "Ορισμός συνθηματικού στο διακομιστή Redis, αν υπάρχει. Το Redis μπορεί να παραμετροποιηθεί να απαιτεί συνθηματικό προτού επιτρέψει τους πελάτες να εκτελούν εντολές.",
        "RedisPasswordFieldTitle": "Συνθηματικό Redis",
        "RedisPortFieldHelp": "Η θύρα στην οποία εκτελείται ο διακομιστής Redis. Η τιμή θα πρέπει να είναι μεταξύ του 1 και του 65535. Χρησιμοποιήστε το 0 αν χρησιμοποιείτε unix soxket για να συνδεθείτε στο διακομιστή Redis.",
        "RedisPortFieldTitle": "Θύρα Redis",
        "RedisTimeoutFieldHelp": "Ο χρόνος λήξης απόκρισης του Redis σε δευτερόλεπτα. Το \"0.0\" σημαίνει χωρίς όριο. Μπορεί να είναι δεκαδικός αριθμός, πχ \"2.5\" για χρόνο λήξης απόκρισης 2.5 δευτερόλεπτα.",
        "RedisTimeoutFieldTitle": "Χρόνος λήξης απόκρισης του Redis",
        "UseSentinelFieldHelp": "Αν είναι ενεργό, θα χρησιμοποιηθεί το χαρακτηριστικό Redis Sentinel. Βεβαιωθείτε να ενημερώσετε το όνομα διακομιστή και τη θύρα αν απαιτηθεί. Από τη στιγμή που θα το ενεργοποιήσετε και αποθηκεύσετε την αλλαγή, θα μπορείτε να καθορίζετε πολλαπλούς διακομιστές και θύρες χωρισμένα με κόμμα.",
        "UseSentinelFieldTitle": "Ενεργοποίηση του Redis Sentinel",
        "WhatRedisBackEndType": "Επιλέξτε ποιο τύπο redis θα χρησιμοποιήσετε. Βεβαιωθείτε να ενημερώσετε το διακομιστή και θύρα αν χρειάζεται. Αφού έχετε κάνει και αποθηκεύσει την αλλαγή, θα μπορείτε να καθορίσετε πολλαπλούς διακομιστές και θύρες με λίστες και χρήση του κόμματος ως διαχωριστή μόνο για τους τύπους \"Sentinel\" και \"Cluster\"."
    }
}
