{
    "QueuedTracking": {
        "ExceptionValueIsNotInt": "The value is not an integer",
        "RedisHostFieldTitle": "Redis host or unix socket",
        "RedisHostFieldHelp": "Remote host or unix socket of the Redis server. Max 500 characters are allowed.",
        "RedisHostFieldHelpExtended": "If your host requires a TLS connection, you can prepend the TLS protocol to your host like: tls://example-host.com. If that does not work, make sure that certificates are configured correctly on your Matomo server.",
        "RedisHostFieldHelpExtendedSentinel": "As you are using Redis Sentinel, you can use a comma separated list. Make sure to specify as many hosts as you have specified ports. For example to configure two servers “127.0.0.1:26379” and “127.0.0.2:26879” specify “127.0.0.1,127.0.0.2” as host and “26379,26879” as ports.",
        "RedisPortFieldTitle": "Redis port",
        "RedisPortFieldHelp": "Port the Redis server is running on. Value should be between 1 and 65535. Use 0 if you are using unix socket to connect to Redis server.",
        "RedisTimeoutFieldTitle": "Redis timeout",
        "RedisTimeoutFieldHelp": "Redis connection timeout in seconds. “0.0” meaning unlimited. Can be a float eg “2.5” for a connection timeout of 2.5 seconds.",
        "NumberOfQueueWorkersFieldTitle": "Number of queue workers",
        "NumberOfQueueWorkersFieldHelp": "Number of allowed maximum queue workers. Accepts a number between 1 and 16. Best practice is to set the number of CPUs you want to make available for queue processing. Be aware you need to make sure to start the workers manually. We recommend to not use 9-15 workers, rather use 8 or 16 as the queue might not be distributed evenly into different queues.",
        "NumberOfQueueWorkersFieldHelpNew": "Number of allowed maximum queue workers. Accepts a number between 1 and 4096. Best practice is to set the number of CPUs you want to make available for queue processing. Be aware you need to make sure to start the workers manually. We recommend to not use 9-15 workers, rather use 8 or 16 as the queue might not be distributed evenly into different queues.",
        "WhatRedisBackEndType": "Select which type of redis to use. Make sure to update host and port if needed. Once you have selected and saved the change, you will be able to specify multiple hosts and ports using comma separated lists for \"Sentinel\" and \"Cluster\" type only.",
        "AvailableRedisBackendTypeStandAlone": "Stand-alone",
        "AvailableRedisBackendTypeSentinel": "Sentinel",
        "AvailableRedisBackendTypeCluster": "Cluster",
        "RedisPasswordFieldTitle": "Redis password",
        "RedisPasswordFieldHelp": "Password set on the Redis server, if any. Redis can be instructed to require a password before allowing clients to execute commands.",
        "RedisDatabaseFieldTitle": "Redis database",
        "RedisDatabaseFieldHelp": "In case you are using Redis for caching make sure to use a different database.",
        "QueueEnabledFieldTitle": "Queue enabled",
        "QueueEnabledFieldHelp": "If enabled, all tracking requests will be written into a queue instead of the directly into the database. Requires a Redis server and phpredis PHP extension if using Redis as a backend.",
        "NumRequestsToProcessFieldTitle": "Number of requests that are processed in one batch",
        "NumRequestsToProcessFieldHelp": "Defines how many requests will be picked out of the queue and processed at once. Enter a number which is >= 1.",
        "ProcessDuringRequestFieldTitle": "Process during tracking request",
        "ProcessDuringRequestFieldHelp": "If enabled, we will process all requests within a queue during a normal tracking request once there are enough requests in the queue. This will not slow down the tracking request. If disabled, you have to setup a cronjob that executes the %1$s./console queuedtracking:process%2$s console command eg every minute to process the queue.",
        "BackendSettingFieldTitle": "Backend",
        "BackendSettingFieldHelp": "Select the backend you want to use for this feature. If you do not have any experience with Redis or it is not available on your server, we recommend using Mysql.",
        "UseSentinelFieldTitle": "Enable Redis Sentinel",
        "UseSentinelFieldHelp": "If enabled, the Redis Sentinel feature will be used. Make sure to update host and port if needed. Once you have enabled and saved the change, you will be able to specify multiple hosts and ports comma separated.",
        "MasterNameFieldTitle": "Redis Sentinel Master name",
        "MasterNameFieldHelp": "The sentinel master name only needs to be configured if Sentinel is enabled.",
        "NumHostsNotMatchNumPorts": "The number of configured hosts doesn't match the number of configured ports.",
        "MultipleServersOnlyConfigurableIfSentinelEnabled": "Multiple hosts or ports can be only configured when Redis Sentinel is on. The plugin README will tell you how to do so."
    }
}
