{
    "QueuedTracking": {
        "BackendSettingFieldHelp": "Bu özellik için kullanmak istediğiniz arka ucu seçin. Redis ile herhangi bir deneyiminiz yoksa veya sunucunuzda kullanılamıyorsa, Mysql kullanmanızı öneririz.",
        "BackendSettingFieldTitle": "Arka uç",
        "ExceptionValueIsNotInt": "Değer bir tam sayı değil",
        "MasterNameFieldHelp": "Sentinel Master adının yalnızca Sentinel açıksa yapılandırılması gerekir.",
        "MasterNameFieldTitle": "Redis Sentinel Master adı",
        "MultipleServersOnlyConfigurableIfSentinelEnabled": "Redis Sentinel eklentisi etkinleştirildiğinde birden çok sunucu ya da bağlantı noktası yapılandırılabilir. Gerekli bilgileri eklentinin README dosyasında bulabilirsiniz.",
        "NumHostsNotMatchNumPorts": "Yapılandırılmış sunucuların sayısı yapılandırılmış bağlantı noktaları ile eşleşmiyor.",
        "NumRequestsToProcessFieldHelp": "Bir kerede kuyruktan kaç isteğin alınacağını ve işleneceğini belirler. 1 değerine eşit veya büyük olan bir sayı yazın.",
        "NumRequestsToProcessFieldTitle": "Bir kerede işlenecek istek sayısı",
        "NumberOfQueueWorkersFieldHelp": "İzin verilen en fazla kuyruk işlemi sayısı. 1 ile 16 arasında bir sayı olabilir. En iyi uygulama, kuyruk işlenmesine ayırmak istediğiniz işlemci sayısını ayarlamaktır. İşlemleri elle başlattığınızdan emin olmanız gerektiğini unutmayın. Kuyruk farklı kuyruklara eşit olarak dağıtılamayabileceğinden 9-15 işlem kullanmamanızı, bunun yerine 8 veya 16 işlem kullanmanızı öneririz.",
        "NumberOfQueueWorkersFieldTitle": "Kuyruk işlemlerinin sayısı",
        "ProcessDuringRequestFieldHelp": "Açıksa, kuyrukta yeterli istek olduğunda, normal bir izleme isteği sırasında kuyruktaki tüm istekler işlenir. Bu seçenek, izleme isteğini yavaşlatmaz. Kapalıysa, kuyruğu işlemek için örneğin 1 dakikada bir %1$s./console queuedtracking:process%2$s konsol komutunu yürüten bir zamanlanmış görev ayarlamanız gerekir.",
        "ProcessDuringRequestFieldTitle": "İzleme isteği sırasında işlensin",
        "QueueEnabledFieldHelp": "Açıksa, tüm izleme istekleri doğrudan veri tabanı yerine bir kuyruğa yazılır. Arka uç olarak Redis kullanılıyorsa bir Redis sunucusu ve phpredis PHP eklentisi gerekir.",
        "QueueEnabledFieldTitle": "Kuyruk açık",
        "RedisDatabaseFieldHelp": "Ön bellek için Redis kullanıyorsanız farklı bir veri tabanı kullandığınızdan emin olun.",
        "RedisDatabaseFieldTitle": "Redis veri tabanı",
        "RedisHostFieldHelp": "Uzak sunucu ya da Redis sunucusunun unix soketi. En fazla 500 karakter uzunluğunda olabilir.",
        "RedisHostFieldHelpExtended": "Sunucunuz için bir TLS bağlantısı gerekiyorsa, TLS iletişim kuralını sunucunuza şu şekilde ekleyebilirsiniz: tls://ornek-sunucu.com. Bu işe yaramazsa, Matomo sunucunuzda sertifikaların doğru yapılandırıldığından emin olun.",
        "RedisHostFieldHelpExtendedSentinel": "Redis Sentinel kullandığınız için virgülle ayrılmış bir liste kullanabilirsiniz. Belirttiğiniz bağlantı noktası sayısı kadar sunucu belirttiğinizden emin olun. Örneğin “127.0.0.1:26379” ve “127.0.0.2:26879” sunucularını yapılandırmak için sunucu olarak “127.0.0.1,127.0.0.2” ve bağlantı noktası olarak “26379,26879” belirtin.",
        "RedisHostFieldTitle": "Redis sunucusu ya da unix soketi",
        "RedisPasswordFieldHelp": "Varsa, Redis sunucusunda ayarlanmış parola. İstemcilerin komutları yürütmesine izin vermeden önce Redis sunucusu için bir parola gerektiği belirtilebilir.",
        "RedisPasswordFieldTitle": "Redis parolası",
        "RedisPortFieldHelp": "Redis sunucusunun çalıştığı bağlantı noktası. Değer 1 ile 65535 arasında olmalıdır. Redis sunucusuna bağlanmak için unix soketi kullanıyorsanız 0 kullanın.",
        "RedisPortFieldTitle": "Redis bağlantı noktası",
        "RedisTimeoutFieldHelp": "Saniye olarak Redis bağlantı zaman aşımı. “0.0” sınırsız anlamına gelir. Bir ondalık sayı olabilir, örneğin 2.5 saniyelik bir bağlantı zaman aşımı için “2.5”.",
        "RedisTimeoutFieldTitle": "Redis zaman aşımı",
        "UseSentinelFieldHelp": "Açıksa, Redis Sentinel özelliği kullanılır. Gerekirse sunucu ve bağlantı noktasını güncellediğinizden emin olun. Açtıktan ve değişikliği kaydettikten sonra, virgülle ayrılmış birden fazla sunucu ve bağlantı noktası belirtebilirsiniz.",
        "UseSentinelFieldTitle": "Redis Sentinel kullanılsın"
    }
}
