{
    "QueuedTracking": {
        "BackendSettingFieldHelp": "Bu özellik için kullanmak istediğiniz arka ucu seçin. Redis ile herhangi bir deneyiminiz yoksa veya sunucunuzda kullanılabilir değilse, Mysql kullanmanızı tavsiye ederiz.",
        "BackendSettingFieldTitle": "Arka uç",
        "ExceptionValueIsNotInt": "Değer bir tam sayı değil",
        "MasterNameFieldHelp": "Sentinel master adının yalnızca Sentinel açıksa yapılandırılması gerekir.",
        "MasterNameFieldTitle": "Redis Sentinel Master adı",
        "MultipleServersOnlyConfigurableIfSentinelEnabled": "Redis Sentinel eklentisi etkinleştirildiğinde birden çok sunucu ya da bağlantı noktası yapılandırılabilir. Gerekli bilgileri eklentinin README dosyasında bulabilirsiniz.",
        "NumHostsNotMatchNumPorts": "Yapılandırılmış sunucuların sayısı yapılandırılmış bağlantı noktaları ile eşleşmiyor.",
        "NumRequestsToProcessFieldHelp": "Kuyruktan tek seferde kaç isteğin alınacağını ve işleneceğini tanımlar. 1'e eşit veya büyük olan bir sayı girin.",
        "NumRequestsToProcessFieldTitle": "Tek seferde işlenen istek sayısı",
        "NumberOfQueueWorkersFieldHelp": "İzin verilen en fazla kuyruk çalıştırıcısı sayısı. 1 ile 16 arasında bir sayı kabul eder. En iyi uygulama, kuyruk işleme için kullanılabilir hale getirmek istediğiniz CPU sayısını ayarlamaktır. Çalıştırıcıları elle başlattığınızdan emin olmanız gerektiğini unutmayın. Kuyruk farklı kuyruklara eşit olarak dağıtılamayabileceğinden 9-15 çalıştırıcı kullanmamanızı, bunun yerine 8 veya 16 çalıştırıcı kullanmanızı tavsiye ederiz.",
        "NumberOfQueueWorkersFieldTitle": "Kuyruk çalıştırıcılarının sayısı",
        "ProcessDuringRequestFieldHelp": "Açıksa, kuyrukta yeterli istek olduğunda normal bir izleme isteği sırasında kuyruktaki tüm istekleri işleyeceğiz. Bu, izleme isteğini yavaşlatmayacaktır. Kapalıysa, kuyruğu işlemek için örneğin her dakika %1$s./console queuedtracking:process%2$s konsol komutunu çalıştıran bir cronjob ayarlamanız gerekir.",
        "ProcessDuringRequestFieldTitle": "İzleme isteği sırasında işle",
        "QueueEnabledFieldHelp": "Açksa, tüm izleme istekleri doğrudan veri tabanı yerine bir kuyruğa yazılacaktır. Arka uç olarak Redis kullanılıyorsa bir Redis sunucusu ve phpredis PHP eklentisi gerekir.",
        "QueueEnabledFieldTitle": "Kuruk açık",
        "RedisDatabaseFieldHelp": "Önbellekleme için Redis kullanıyorsanız farklı bir veri tabanı kullandığınızdan emin olun.",
        "RedisDatabaseFieldTitle": "Redis veri tabanı",
        "RedisHostFieldHelp": "Redis sunucusunun uzak sunucusu veya unix soketi. En fazla 500 karaktere izin verilir.",
        "RedisHostFieldHelpExtended": "Sunucunuz bir TLS bağlantısı gerektiriyorsa, TLS iletişim kuralını sunucunuza şu şekilde ekleyebilirsiniz: tls://örnek-sunucu.com. Bu işe yaramazsa, Matomo sunucunuzda sertifikaların doğru yapılandırıldığından emin olun.",
        "RedisHostFieldHelpExtendedSentinel": "Redis Sentinel kullandığınız için virgülle ayrılmış bir liste kullanabilirsiniz. Belirttiğiniz bağlantı noktası sayısı kadar sunucu belirttiğinizden emin olun. Örneğin “127.0.0.1:26379” ve “127.0.0.2:26879” sunucularını yapılandırmak için sunucu olarak “127.0.0.1,127.0.0.2” ve bağlantı noktası olarak “26379,26879” belirtin.",
        "RedisHostFieldTitle": "Redis sunucusu veya unix soketi",
        "RedisPasswordFieldHelp": "Varsa, Redis sunucusunda ayarlanan parola. Redis'e, istemcilerin komutları çalıştırmasına izin vermeden önce bir parola gerektirmesi belirtilebilir.",
        "RedisPasswordFieldTitle": "Redis parolası",
        "RedisPortFieldHelp": "Redis sunucusunun çalıştığı bağlantı noktası. Değer 1 ile 65535 arasında olmalıdır. Redis sunucusuna bağlanmak için unix soketi kullanıyorsanız 0 kullanın.",
        "RedisPortFieldTitle": "Redis bağlantı noktası",
        "RedisTimeoutFieldHelp": "Saniye cinsinden Redis bağlantı zaman aşımı. “0.0” sınırsız anlamına gelir. Bir ondalık sayı olabilir, örneğin 2.5 saniyelik bir bağlantı zaman aşımı için “2.5”.",
        "RedisTimeoutFieldTitle": "Redis zaman aşımı",
        "UseSentinelFieldHelp": "Açıksa, Redis Sentinel özelliği kullanılacaktır. Gerekirse sunucu ve bağlantı noktasını güncellediğinizden emin olun. Açtıktan ve değişikliği kaydettikten sonra, virgülle ayrılmış birden fazla sunucu ve bağlantı noktası belirtebileceksiniz.",
        "UseSentinelFieldTitle": "Redis Sentinel kullan"
    }
}
